doc/avc_decoder_mvp_arch_spec.md
```mermaid
stateDiagram-v2
    [*] --> AMVP_IDLE
    AMVP_IDLE --> AMVP_WAIT_CU_START: cur_ctu_start && !reg_i_slice
    AMVP_IDLE --> AMVP_IDLE: otherwise
    AMVP_WAIT_CU_START --> AMVP_WAIT_NEIB_DONE: |empty_n
    AMVP_WAIT_CU_START --> AMVP_WAIT_CU_START: !|empty_n
    AMVP_WAIT_NEIB_DONE --> AMVP_CAND_BLK8: neib_done_con
    AMVP_WAIT_NEIB_DONE --> AMVP_WAIT_NEIB_DONE: !neib_done_con
    AMVP_CAND_BLK8 --> AMVP_CAND_BLK16: cand_blk_done && empty_n[1]
    AMVP_CAND_BLK8 --> AMVP_CAND_BLK32: cand_blk_done && !empty_n[1] && empty_n[2]
    AMVP_CAND_BLK8 --> AMVP_BLK_DONE: cand_blk_done && !empty_n[1] && !empty_n[2]
    AMVP_CAND_BLK8 --> AMVP_CAND_BLK8: !cand_blk_done
    AMVP_CAND_BLK16 --> AMVP_CAND_BLK32: cand_blk_done && empty_n[2]
    AMVP_CAND_BLK16 --> AMVP_BLK_DONE: cand_blk_done && !empty_n[2]
    AMVP_CAND_BLK16 --> AMVP_CAND_BLK16: !cand_blk_done
    AMVP_CAND_BLK32 --> AMVP_BLK_DONE: cand_blk_done
    AMVP_CAND_BLK32 --> AMVP_CAND_BLK32: !cand_blk_done
    AMVP_BLK_DONE --> AMVP_WAIT_NEIB_DONE: !&chk_ref_done
    AMVP_BLK_DONE --> AMVP_WAIT_CU_START: &chk_ref_done && !(cux==7 && cuy==7)
    AMVP_BLK_DONE --> AMVP_IDLE: &chk_ref_done && cux==7 && cuy==7
```
